integration/04-waveFlume_stokesV_h0.1m_4cmX1cm/constant/IHWavesDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      IHWavesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

waveType        regular;

waveTheory      StokesV;

genAbs          1;

nPaddles        1;

waveHeight      0.1;

wavePeriod      2.0;

waveDir         0.0;

tSmooth		4.0;

// ************************************************************************* //
